Psyche/app/controllers/admin_controller.rb

SELECT `users`.* FROM `users` WHERE (`users`.`password` = 'a9726dca1f70894106b530ebcf7457a4') AND (`users`.`username` = 'admin') AND (`users`.`id` = 1) LIMIT 1
---
   def check

    #attempt to get the entered user
    @user = User.where(:username=>params[:username],:password=>Digest::MD5.hexdigest(params[:password]))