Psyche/app/controllers/posts_controller.rb

  def postfeed
    @posts = Post.all
---
SELECT `posts`.* FROM `posts`