Psyche/app/controllers/router_controller.rb

	def index

			     #store the url entered
			     @url = params[:a]

			     #get the permalink settings from the database
			     @post_permalink_settings = Settings.where(:setting=>"post-permalink").first.value
---
SELECT `posts`.* FROM `posts` WHERE (`posts`.`permalink` = '/contact') LIMIT 1
SELECT `settings`.* FROM `settings` WHERE (`settings`.`setting` = 'post-permalink') LIMIT 1


			          @pages.each do|s|

			            @is_page = Page.where(:title=>s).first
---
SELECT `pages`.* FROM `pages` WHERE (`pages`.`title` = 'index') LIMIT 1